//Напишите программу, которая принимает на вход число и выдаёт 
//сумму цифр в числе.
/*
int[] Sum(int size)
  {
    int sum = 0;
    int[] newArray = new int[size];
    
    for(int i = 0; i < size; i++)
    {
        sum = sum + newArray[i];
    }
    return newArray;
  }

Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Сумма цифр в числе: " + Sum);*/

//Напишите программу, которая задаёт массив из m элементов и выводит их на экран.

int[] Massiv(int size)
{
  int[]newArray = new int[size];
  
  return newArray;
}

Console.Write("Задайте массив: ");
int massiv = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("[" + massiv + "]");